> 
> # Initializing everything
> proch system HOST1
> chost HOST1
> $MP1 ! micropay bob 10 carol 10 dave 10
> $MP2 ! micropay bob 10 carol 10 dave 10
> $MP3 ! micropay bob 10 carol 10 dave 10
> proc bob SC1 $MP1
> proc carol SC2 $MP2
> proc dave SC3 $MP3
> join GR1 _ SC1 SC2 SC3
> 
> # We start with 3 procs/ledgers, each containing $10, joined
> #                                       [ in a state channel
> netlist
  PID      NAME   USER    PEER                 SELF       
  0^       SC1    bob     ("SC1" "SC2" "SC3")  @micropay@0
  0procg^  GR1    nobody  (_)                  _          
  0h^      HOST1  system  (_)                  _          
  0ph_     phys   system  (_)                  _          
  1^       SC2    carol   ("SC1" "SC2" "SC3")  @micropay@1
  2^       SC3    dave    ("SC1" "SC2" "SC3")  @micropay@2
  6 procs
> 
> state SC1
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 10
      carol = 10
      dave = 10
> 
> state SC2
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 10
      carol = 10
      dave = 10
> 
> state SC3
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 10
      carol = 10
      dave = 10
> 
> # First transfer
> netlist SC1
  SC1 bob ^
  in:
  rl:
  out:
> 
> iam SC1
> GR1 ^ transfer carol 2
> run
> netlist SC1
  SC1 bob ^
  in:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol)[31;49m!![39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob dave)[31;49m!![39;49m
  rl:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol dave)[31;49m!*[39;49m
  out:
    <0 _>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
> 
> netlist SC2
  SC2 carol ^
  in:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob dave)[31;49m!![39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m!![39;49m
  rl:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol dave)[31;49m!*[39;49m
  out:
> 
> netlist SC3
  SC3 dave ^
  in:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol)[31;49m!![39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m!![39;49m
  rl:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob dave carol)[31;49m!*[39;49m
  out:
> 
> state SC1
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 8
      carol = 12
      dave = 10
> 
> state SC2
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 8
      carol = 12
      dave = 10
> 
> state SC3
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 8
      carol = 12
      dave = 10
> 
> # Second transfer
> iam SC2
> GR1 ^ transfer dave 7
> run
> netlist SC1
  SC1 bob ^
  in:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol)[31;49m!![39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob dave)[31;49m!![39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol)[31;49m[39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol dave)[31;49m!![39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol)[31;49m!![39;49m
  rl:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol dave)[31;49m!*[39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol bob dave)[31;49m!*[39;49m
  out:
    <0 _>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
> 
> netlist SC2
  SC2 carol ^
  in:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob dave)[31;49m!![39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m!![39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol)[31;49m[39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol dave)[31;49m!![39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol bob)[31;49m!![39;49m
  rl:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol dave)[31;49m!*[39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol bob dave)[31;49m!*[39;49m
  out:
    <0 _>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol)[31;49m[39;49m
> 
> netlist SC3
  SC3 dave ^
  in:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m[39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob carol)[31;49m!![39;49m
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob)[31;49m!![39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol)[31;49m[39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol bob)[31;49m!![39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol)[31;49m!![39;49m
  rl:
    <0 0>transfer SC1=>GR1 (carol 2) ([31;49mS[39;49m bob dave carol)[31;49m!*[39;49m
    <0 1>transfer SC2=>GR1 (dave 7) ([31;49mS[39;49m carol dave bob)[31;49m!*[39;49m
  out:
> 
> state SC1
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 8
      carol = 5
      dave = 17
> 
> state SC2
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 8
      carol = 5
      dave = 17
> 
> state SC3
  @micropay
    STATE = Started
    ACCOUNT = @rexpr
      bob = 8
      carol = 5
      dave = 17
> 
> # Quitting
> q
